degree_choices = [
    ('زیر دیپلم', 'زیر دیپلم'),
    ('دیپلم', 'دیپلم'),
    ('فوق دیپلم', 'فوق دیپلم'),
    ('لیسانس', 'لیسانس'),
    ('فوق لیسانس', 'فوق لیسانس'),
    ('دکترا', 'دکترا'),
    ('دکترا پزشکی', 'دکترا پزشکی'),
]
is_guard_duty_CHOICES = [
    (False, 'خیر'),
    (True, 'بلی'),
]
driving_license_type_choices = [
    ('پایه سوم', 'پایه سوم'),
    ('پایه دوم', 'پایه دوم'),
    ('پایه اول', 'پایه اول'),
    ('موتورسیکلت', 'موتورسیکلت'),
    ('ویژه', 'ویژه'),
    ('ندارد', 'ندارد'),
]
has_driving_license_choices = [
    ('دارد', 'دارد'),
    ('ندارد', 'ندارد'),
]
skill_group_choices = [
    (
        'گروه 1 : پزشکی و پیراپزشکی = گروه پیراپزشکی(رادیولوژی،هوش بری،علوم آزمایشگاهی،اتاق عمل،فوریت پزشکی ،کادر درمان)',
        'گروه 1 : پزشکی و پیراپزشکی = گروه پیراپزشکی(رادیولوژی،هوش بری،علوم آزمایشگاهی،اتاق عمل،فوریت پزشکی ،کادر درمان)'),
    ('گروه 2 : تحصیلات تکمیلی و غیرپزشکی = فوق لیسانس، دکتری و فوق دکتری',
        'گروه 2 : تحصیلات تکمیلی و غیرپزشکی = فوق لیسانس، دکتری و فوق دکتری'),
    ('گروه 3 : لیسانس = در صورت بکارگیری در پست مرتبط با تحصیلات ،عدم نیاز به آموزش',
        'گروه 3 : لیسانس = در صورت بکارگیری در پست مرتبط با تحصیلات ،عدم نیاز به آموزش'),
    ('گروه 4 : فوق دیپلم و دیپلم فنی و حرفه ای و کاردانش', 'گروه 4 : فوق دیپلم و دیپلم فنی و حرفه ای و کاردانش'),
    ('گروه 5 : فوق دیپلم و دیپلم به پایین', 'گروه 5 : فوق دیپلم و دیپلم به پایین'),
    ('گروه 6 : دارندگان گواهینامه فنی و حرفه ای', 'گروه 6 : دارندگان گواهینامه فنی و حرفه ای'),
    ('گروه 7 : فوق دیپلم و دیپلم که در سالهای گذشته گواهینامه گرفته اند و همچنان سرباز می باشند',
        'گروه 7 : فوق دیپلم و دیپلم که در سالهای گذشته گواهینامه گرفته اند و همچنان سرباز می باشند')
]
independent_married_choices = [
    (True, 'بله'),
    (False, 'خیر')
]
need_certificate_choices = [
    (True, 'بله'),
    (False, 'خیر')
]
skill_certificate_choices = [
    ('مدرک 1', 'مدرک 1')
]
RANK_CHOICES = [
    ('سرباز(1)', 'سرباز(1)'),
    ('سرباز دوم(2)', 'سرباز دوم(2)'),
    ('سرباز یکم(3)', 'سرباز یکم(3)'),
    ('رزمیار(4)', 'رزمیار(4)'),
    ('رزم آور سوم(5)', 'رزم آور سوم(5)'),
    ('رزم آور دوم(6)', 'رزم آور دوم(6)'),
    ('رزم آور یکم(7)', 'رزم آور یکم(7)'),
    ('رزمدار دوم(8)', 'رزمدار دوم(8)'),
    ('رزمدار یکم(9)', 'رزمدار یکم(9)'),
    ('ستوان سوم(10)', 'ستوان سوم(10)'),
    ('ستوان دوم(11)', 'ستوان دوم(11)'),
    ('ستوان یکم(12)', 'ستوان یکم(12)'),
]
MARITAL_STATUS_CHOICES = [('مجرد', 'مجرد'), ('متاهل', 'متاهل')]
HEALTH_STATUS_CHOICES = [('سالم', 'سالم'), ('معاف از رزم', 'معاف از رزم'), ('گروه ب', 'گروه ب'),
                            ('معاف+گروه ب', 'معاف+گروه ب'), ]
blood_group_choices = [('A+', 'A+'), ('A-', 'A-'), ('B+', 'B+'), ('B-', 'B-'),
                        ('AB+', 'AB+'), ('AB-', 'AB-'), ('O+', 'O+'), ('O-', 'O-')]
traffic_status_choices = [('روزانه', 'روزانه'), ('هفتگی', 'هفتگی'), ('ماهانه', 'ماهانه')]


# ==========================
# داده نمونه
# ==========================
ORGANIZATIONAL_CODE_SAMPLE = [
    {"national_code": "1234567890", "org_code": "4501", "status": "غیرفعال"},
    {"national_code": "0087654321", "org_code": "4502", "status": "فعال"},
]

SOLDIER_ORG_CODE_SAMPLE = [
    {"national_code": "1234567890", "org_code": "4501", "new_status": "فعال"},
    {"national_code": "0087654321", "org_code": "4502", "new_status": "غیرفعال"},
]
